package p400;
import java.awt.*;
import javax.swing.*;

/**
 *
 * @author  Stepan M
 * @version 2022.09.28
 * Написать приложение с графическим интерфейсом реагирующую на событие.
 * P390
 */

public class HomeWorkGui {

    //Cоздать фрейм с двумя виджетами (панелью рисования и кнопкой).
    //Создать слушатель, который связывается с кнопкой.
    //Далее фрейм выводится на экран и ждет когда пользователь нажмет кнопку.

    //Пользователь нажимает кнопку, она создает объект события и вызывает обработкич события принадлежащий слушателю

    //Обработчик запускает метод repaint (), принадлежащий фрейму.
    //Система ывазывает метод paintComponent() в контексте панели для отрисовки

    //Генерируется новый цвето по нажатию кнопки.

}
