package p511;


/**
 * @author  Stepan M
 * @version 2022.10.05
 * Задание типа "Готовый код"
 * Сервенрая часть
 * Программа - советчик, пример простого клиент-серверного приложения.
 * Создает ServerSocket и ожидает клиентские запросы.
 * При получении запроса (клиент выполнил new Socket()) сервер
 *  создает объект Socket и устанавливает соединение с этим клиентом.
 * Сервер создает экземпляр PrintWriter( с помощью исходящего потока из сокета) и отправляет клиенту сообщение.
 * P511
 */

public class DailyAdviceServer {
}
